Autodesk.Revit.DB.OptionalFunctionalityUtils.IsShapeImporterAvailable
Checks whether the ShapeImporter functionality and Material Library are available in the installed Revit.
Returns:
True if the ShapeImporter functionality and Material Library are available in the installed Revit.
Since:
2016

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsMaterialLibraryAvailable
Checks whether the Material Library is available in the installed Revit.
Returns:
True if the Material Library is available in the installed Revit.
Since:
2026